In [ ]:
!pip install pandas

In [3]:
import pandas as pd

In [4]:
dicionario = {
    'A': [1, 2, 3],
    'B': [-3, -2, -1],
    'C': [0, 10, 20],
    }
label =  ['1 linha', '2 linha', '3 linha']
datafreme = pd.DataFrame(data=dicionario, index=label)
print(datafreme)

         A  B   C
1 linha  1 -3   0
2 linha  2 -2  10
3 linha  3 -1  20

In [5]:
datafreme[['A','B']]

         A  B
1 linha  1 -3
2 linha  2 -2
3 linha  3 -1

In [6]:
datafreme['nova coluna'] = datafreme['A'] * datafreme['B']

In [7]:
datafreme

         A  B   C  nova coluna
1 linha  1 -3   0           -3
2 linha  2 -2  10           -4
3 linha  3 -1  20           -3

In [12]:
A = 6
print(A)
datafreme

6

         A  B   C
1 linha  1 -3   0
2 linha  2 -2  10
3 linha  3 -1  20

In [9]:
datafreme.drop('nova coluna', axis=1)

         A  B   C
1 linha  1 -3   0
2 linha  2 -2  10
3 linha  3 -1  20

In [10]:
datafreme.drop('nova coluna', axis=1, inplace=True)

In [25]:
datafreme

         A  B   C
1 linha  1 -3   0
2 linha  2 -2  10
3 linha  3 -1  20

In [18]:
datafreme.loc['1 linha']

A    1
B   -3
C    0
Name: 1 linha, dtype: int64

In [19]:
datafreme.loc['2 linha']

A     2
B    -2
C    10
Name: 2 linha, dtype: int64

In [20]:
datafreme.loc['3 linha']

A     3
B    -1
C    20
Name: 3 linha, dtype: int64

In [22]:
datafreme.loc[['1 linha', '2 linha'],['A', 'C']]

         A   C
1 linha  1   0
2 linha  2  10

In [23]:
datafreme.iloc[2:3, 1:]

         B   C
3 linha -1  20

In [29]:
print(datafreme)
datafreme > 0

         A  B   C
1 linha  1 -3   0
2 linha  2 -2  10
3 linha  3 -1  20

            A      B      C
1 linha  True  False  False
2 linha  True  False   True
3 linha  True  False   True

In [31]:
filtro = datafreme['C'] > 0
datafreme2 = datafreme[filtro]
datafreme2

         A  B   C
2 linha  2 -2  10
3 linha  3 -1  20

In [33]:
datafreme[(datafreme['A']>1) & (datafreme['C']>0)]

         A  B   C
2 linha  2 -2  10
3 linha  3 -1  20

In [34]:
datafreme

         A  B   C
1 linha  1 -3   0
2 linha  2 -2  10
3 linha  3 -1  20

In [ ]:
datafreme.reset_index()

     index  A  B   C
0  1 linha  1 -3   0
1  2 linha  2 -2  10
2  3 linha  3 -1  20

In [ ]:
datafreme.reset_index(inplace=True)

   level_0    index  A  B   C
0        0  1 linha  1 -3   0
1        1  2 linha  2 -2  10
2        2  3 linha  3 -1  20

In [41]:
datafreme.drop('level_0', axis=1, inplace=True)

In [42]:
datafreme.drop('index', axis=1, inplace=True)

In [43]:
datafreme

   A  B   C
0  1 -3   0
1  2 -2  10
2  3 -1  20